{
  "hello": "Hi there! 👋 How can I help you today?",
  "hi": "Hello! Ask me anything about the university.",
  "help": "You can ask about admissions, courses, deadlines, support, or campus facilities!",
  "admissions": "Our admissions office is open Monday to Friday, 9 AM to 5 PM. You can apply online via the Admissions portal.",
  "application deadline": "The deadline for Fall 2025 applications is August 1, 2025.",
  "scholarships": "Yes, we offer merit-based and need-based scholarships. Visit the financial aid page for more details.",
  "courses": "We offer undergraduate and graduate programs in CS, Engineering, Business, Arts, and more.",
  "departments": "Our main departments include Computer Science, Business, Engineering, Humanities, and Health Sciences.",
  "computer science": "Our CS department offers courses in AI, Data Structures, Web Dev, and more.",
  "business": "The Business department offers majors in Marketing, Finance, and Management.",
  "engineering": "We offer Civil, Mechanical, Electrical, and Software Engineering programs.",
  "library hours": "The library is open 7 AM – 11 PM on weekdays and 9 AM – 8 PM on weekends.",
  "student support": "You can reach our support team 24/7 via the Help Desk or by emailing support@university.edu.",
  "campus life": "Campus life includes clubs, events, sports, and student housing. Get involved and stay connected!",
  "housing": "We offer both on-campus and off-campus housing. Visit the Housing page to learn more.",
  "tuition fees": "Tuition varies by program. Visit our Fees page for the most up-to-date information.",
  "internships": "Internship listings are available through the Career Portal. Don’t forget to attend our Career Fairs!",
  "events": "Upcoming events include Hackathons, Career Week, Cultural Fest, and Alumni Talks.",
  "contact": "You can contact us at info@university.edu or call +1-800-123-4567.",
  "contact admissions": "For admissions inquiries, email admissions@university.edu or call +1-800-111-2222.",
  "contact support": "Need help? Reach our 24/7 support team at support@university.edu or use the Help Desk portal.",
  "contact housing": "Questions about student housing? Email housing@university.edu or call +1-800-333-4444.",
  "contact library": "Library services can be reached at library@university.edu.",
  "faculty contact": "Faculty contact info is available on each department page. You can also email info@university.edu for help.",
  "default": "Sorry, I didn't understand that. Can you please rephrase your question?",
  "bye": "Goodbye! 👋 Feel free to ask more questions any time.",
  "thank you": "You're welcome!  Let me know if you need anything else."
}